CSI API ETABS v1

# cCaseResponseSpectrum Interface

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    public interface cCaseResponseSpectrum

    Public Interface cCaseResponseSpectrum

    Dim instance As cCaseResponseSpectrum

    public interface class cCaseResponseSpectrum

    type cCaseResponseSpectrum =  interface end

The cCaseResponseSpectrum type exposes the following members.

Methods

| Name| Description
---|---|---
|
GetDampConstant|
|
GetDampInterpolated|
|
GetDampOverrides|
|
GetDampProportional|
|
GetDampType|
|
GetDiaphragmEccentricityOverride|
|
GetDirComb|
|
GetEccentricity|
|
GetLoads|
|
GetModalCase|
|
GetModalComb|
|
GetModalComb_1|
|
SetCase|
|
SetEccentricity|
|
SetLoads|
|
SetModalCase|
Top

See Also

#### Reference

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com